applications/customSolvers/sediFoam-master/cases/example-cases/jetFlow/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
p
{
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-10;
    relTol          0;
}

// using new solver syntax:
Ua
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

// using new solver syntax:
Ub
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

// using new solver syntax:
alpha
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-10;
    relTol          0;
}

tempDiffScalar
{
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-10;
    relTol          0;
}

tempDiffVector
{
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-10;
    relTol          0;
}

// using new solver syntax:
beta
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-10;
    relTol          0;
}

// using new solver syntax:
k
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

// using new solver syntax:
epsilon
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 3;
    nAlphaCorr      2;
    correctAlpha    no;
    pRefCell        0;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
